Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_spic_type.h
/**************************************************************************//**
 * @defgroup SPIC_WRITE_QUAD_ADDR_DATA
 * @brief  Quad IO Page Program Command Register     (@ 0X104)
 * @{
 *****************************************************************************/
#define SPIC_SHIFT_WR_QUAD_II_CMD                    0
#define SPIC_MASK_WR_QUAD_II_CMD                     ((u32)0x000000FF << 0)                              /*!<R/W 0x38   */
/** @} */

/**************************************************************************//**
 * @defgroup SPIC_WRITE_ENABLE
 * @brief  Write Enable Command Register             (@ 0X108)
 * @{
 *****************************************************************************/
#define SPIC_SHIFT_WR_EN_CMD                         0
#define SPIC_MASK_WR_EN_CMD                          ((u32)0x0000FFFF << 0)                              /*!<R/W 0x0606   */
/** @} */

/**************************************************************************//**
 * @defgroup SPIC_READ_STATUS
 * @brief  Read Status Command Register              (@ 0X10C)
 * @{
 *****************************************************************************/
#define SPIC_SHIFT_RD_ST_CMD                         0
#define SPIC_MASK_RD_ST_CMD                          ((u32)0x0000FFFF << 0)                              /*!<R/W 0x0505   */
/** @} */

/**************************************************************************//**
 * @defgroup SPIC_CTRLR2
 * @brief  SPIC Control Register 2                   (@ 0X110)
 * @{
 *****************************************************************************/
#define SPIC_SHIFT_CS_ACTIVE_HOLD                    12
#define SPIC_MASK_CS_ACTIVE_HOLD                     ((u32)0x00000003 << 12)                             /*!<R/W 0   */
#define SPIC_SHIFT_RX_FIFO_ENTRY                     8
#define SPIC_MASK_RX_FIFO_ENTRY                      ((u32)0x0000000F << 8)                              /*!<R/W 0x6   */
#define SPIC_SHIFT_TX_FIFO_ENTRY                     4
#define SPIC_MASK_TX_FIFO_ENTRY                      ((u32)0x0000000F << 4)                              /*!<R/W 0x6   */
#define SPIC_SHIFT_SEQ_EN                            3
#define SPIC_BIT_SEQ_EN                              ((u32)0x00000001 << 3)                              /*!<R/W 0   */
#define SPIC_SHIFT_SO_DNUM                           0
#define SPIC_BIT_SO_DNUM                             ((u32)0x00000001 << 0)                              /*!<R/W 1   */
/** @} */

/**************************************************************************//**
 * @defgroup SPIC_FBAUDR
 * @brief  Fast Read Baud Rate Select Register       (@ 0X114)
 * @{
 *****************************************************************************/
#define SPIC_SHIFT_FSCKDV                            0
#define SPIC_MASK_FSCKDV                             ((u32)0x00000FFF << 0)                              /*!<R/W 1   */
/** @} */

/**************************************************************************//**
 * @defgroup SPIC_ADDR_LENGTH
 * @brief  Address Byte Length Register              (@ 0X118)
 * @{
 *****************************************************************************/
#define SPIC_SHIFT_ADDR_PHASE_LENGTH                 0
#define SPIC_MASK_ADDR_PHASE_LENGTH                  ((u32)0x00000007 << 0)                              /*!<R/W 0x3   */
/** @} */

/**************************************************************************//**
 * @defgroup SPIC_AUTO_LENGTH
 * @brief  Auto Mode Address Byte Length Register    (@ 0X11C)
 * @{
 *****************************************************************************/
#define SPIC_SHIFT_CS_H_WR_DUM_LEN                   28
#define SPIC_MASK_CS_H_WR_DUM_LEN                    ((u32)0x0000000F << 28)                             /*!<R/W 0x2   */
#define SPIC_SHIFT_CS_H_RD_DUM_LEN                   26
#define SPIC_MASK_CS_H_RD_DUM_LEN                    ((u32)0x00000003 << 26)                             /*!<R/W 0x2   */
#define SPIC_SHIFT_AUTO_DUM_LEN                      18
#define SPIC_MASK_AUTO_DUM_LEN                       ((u32)0x000000FF << 18)                             /*!<R/W 0   */
#define SPIC_SHIFT_AUTO_ADDR_LENGTH                  16
#define SPIC_MASK_AUTO_ADDR_LENGTH                   ((u32)0x00000003 << 16)                             /*!<R/W 0x3   */
#define SPIC_SHIFT_RD_DUMMY_LENGTH                   0
#define SPIC_MASK_RD_DUMMY_LENGTH                    ((u32)0x00000FFF << 0)                              /*!<R/W 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SPIC_VALID_CMD
 * @brief  Valid Command Register                    (@ 0X120)
 * @{
 *****************************************************************************/
#define SPIC_SHIFT_CTRLR0_CH                         12
#define SPIC_BIT_CTRLR0_CH                           ((u32)0x00000001 << 12)                             /*!<R/W 0   */
#define SPIC_SHIFT_PRM_EN                            11
#define SPIC_BIT_PRM_EN                              ((u32)0x00000001 << 11)                             /*!<R/W 0   */
#define SPIC_SHIFT_WR_BLOCKING                       9
#define SPIC_BIT_WR_BLOCKING                         ((u32)0x00000001 << 9)                              /*!<R/W 1   */
#define SPIC_SHIFT_WR_QUAD_II                        8
#define SPIC_BIT_WR_QUAD_II                          ((u32)0x00000001 << 8)                              /*!<R/W 0   */
#define SPIC_SHIFT_WR_QUAD_I                         7
#define SPIC_BIT_WR_QUAD_I                           ((u32)0x00000001 << 7)                              /*!<R/W 0   */
#define SPIC_SHIFT_WR_DUAL_II                        6
#define SPIC_BIT_WR_DUAL_II                          ((u32)0x00000001 << 6)                              /*!<R/W 0   */
#define SPIC_SHIFT_WR_DUAL_I                         5
#define SPIC_BIT_WR_DUAL_I                           ((u32)0x00000001 << 5)                              /*!<R/W 0   */
#define SPIC_SHIFT_RD_QUAD_IO                        4
#define SPIC_BIT_RD_QUAD_IO                          ((u32)0x00000001 << 4)                              /*!<R/W 0   */
#define SPIC_SHIFT_RD_QUAD_O                         3
#define SPIC_BIT_RD_QUAD_O                           ((u32)0x00000001 << 3)                              /*!<R/W 0   */
#define SPIC_SHIFT_RD_DUAL_IO                        2
#define SPIC_BIT_RD_DUAL_IO                          ((u32)0x00000001 << 2)                              /*!<R/W 0   */
#define SPIC_SHIFT_RD_DUAL_I                         1
#define SPIC_BIT_RD_DUAL_I                           ((u32)0x00000001 << 1)                              /*!<R/W 0   */
#define SPIC_SHIFT_FRD_SINGLE                        0
#define SPIC_BIT_FRD_SINGLE                          ((u32)0x00000001 << 0)                              /*!<R/W 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SPIC_FLASH_SIZE
 * @brief  Write Enable Command Register             (@ 0X124)
 * @{
 *****************************************************************************/
#define SPIC_SHIFT_FLASH_SIZE                        0
#define SPIC_MASK_FLASH_SIZE                         ((u32)0x0000000F << 0)                              /*!<R/W 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SPIC_FLUSH_FIFO
 * @brief  Read Status Command Register              (@ 0X128)
 * @{
 *****************************************************************************/
#define SPIC_SHIFT_FLUSH_FIFIO                       0
#define SPIC_BIT_FLUSH_FIFIO                         ((u32)0x00000001 << 0)                              /*!<W 0   */
/** @} */

/**************************************************************************//**
 * @defgroup rtl8735b_SPIC
 * @{
 * @brief rtl8735b_SPIC Register Declaration
 *****************************************************************************/
typedef struct {
	__IO uint32_t SPIC_CTRLR0 ;                            /*!<  SPIC Control Register 0 register,  Address offset: 0x000 */
	__IO uint32_t SPIC_CTRLR1 ;                            /*!<  SPIC Control Register 1 register,  Address offset: 0x004 */
	__IO uint32_t SPIC_SSIENR ;                            /*!<  SPIC Enable Register register,  Address offset: 0x008 */
	__I  uint32_t SPIC_RESERVED ;                          /*!<   register,  Address offset: 0x00C */
	__IO uint32_t SPIC_SER ;                               /*!<  Slave Enable Register register,  Address offset: 0x010 */
	__IO uint32_t SPIC_BAUDR ;                             /*!<  Baud Rate Select Register register,  Address offset: 0x014 */
	__IO uint32_t SPIC_TXFTLR ;                            /*!<  Transmit FIFO Threshold Level register,  Address offset: 0x018 */
	__IO uint32_t SPIC_RXFTLR ;                            /*!<  Receive FIFO Threshold Level register,  Address offset: 0x01C */
	__I  uint32_t SPIC_TXFLR ;                             /*!<  Transmit FIFO Level Register register,  Address offset: 0x020 */
	__I  uint32_t SPIC_RXFLR ;                             /*!<  Receive FIFO Level Register register,  Address offset: 0x024 */
	__I  uint32_t SPIC_SR ;                                /*!<  Status Register register,  Address offset: 0x028 */
	__IO uint32_t SPIC_IMR ;                               /*!<  Interrupt Mask Register register,  Address offset: 0x02C */
	__I  uint32_t SPIC_ISR ;                               /*!<  Interrupt Status Register register,  Address offset: 0x030 */
	__I  uint32_t SPIC_RISR ;                              /*!<  Raw Interrupt Status Register register,  Address offset: 0x034 */
	__I  uint32_t SPIC_TXOICR ;                            /*!<  Transmit FIFO Overflow Interrupt Clear Register register,  Address offset: 0x038 */
	__I  uint32_t SPIC_RXOICR ;                            /*!<  Receive FIFO Overflow Interrupt Clear Register register,  Address offset: 0x03C */
	__I  uint32_t SPIC_RXUICR ;                            /*!<  Receive FIFO Underflow Interrupt Clear Register register,  Address offset: 0x040 */
	__I  uint32_t SPIC_FAEICR ;                            /*!<  Frame Alignment Interrupt Clear Register register,  Address offset: 0x044 */
	__I  uint32_t SPIC_ICR ;                               /*!<  Interrupt Clear Register register,  Address offset: 0x048 */
	__IO uint32_t SPIC_DMACR ;                             /*!<  DMA Control Register register,  Address offset: 0x04C */
	__IO uint32_t SPIC_DMATDLR ;                           /*!<  DMA Transmit Data Level Register register,  Address offset: 0x050 */
	__IO uint32_t SPIC_DMARDLR ;                           /*!<  DMA Receive Data Level Register register,  Address offset: 0x054 */
	__I  uint32_t SPIC_IDR ;                               /*!<  Identification Code Register register,  Address offset: 0x058 */
	__I  uint32_t SPIC_SPIC_VER ;                          /*!<  SPIC Version Register register,  Address offset: 0x05C */
	__IO uint32_t SPIC_DR_WORD ;                           /*!<  Data Register register,  Address offset: 0x060 */
	__IO uint32_t RSVD0[31];                               /*!<  Reserved,  Address offset:0x64-0xDC */
	__IO uint32_t SPIC_READ_FAST_SINGLE ;                  /*!<  Fast Read Command Register register,  Address offset: 0x0E0 */
	__IO uint32_t SPIC_READ_DUAL_DATA ;                    /*!<  Dual Read Command Register register,  Address offset: 0x0E4 */
	__IO uint32_t SPIC_READ_DUAL_ADDR_DATA ;               /*!<  Dual IO Read Command Register register,  Address offset: 0x0E8 */
	__IO uint32_t SPIC_READ_QUAD_DATA ;                    /*!<  Quad Read Command Register register,  Address offset: 0x0EC */
	__IO uint32_t SPIC_READ_QUAD_ADDR_DATA ;               /*!<  Quad IO Read Command Register register,  Address offset: 0x0F0 */
	__IO uint32_t SPIC_WRITE_SINGLE ;                      /*!<  Single IO Page Program Command Register register,  Address offset: 0x0F4 */
	__IO uint32_t SPIC_WRITE_DUAL_DATA ;                   /*!<  Dual Page Program Command Register register,  Address offset: 0x0F8 */
	__IO uint32_t SPIC_WRITE_DUAL_ADDR_DATA ;              /*!<  Dual IO Page Program Command Register register,  Address offset: 0x0FC */
	__IO uint32_t SPIC_WRITE_QUAD_DATA ;                   /*!<  Quad Page Program Command Register register,  Address offset: 0x100 */
	__IO uint32_t SPIC_WRITE_QUAD_ADDR_DATA ;              /*!<  Quad IO Page Program Command Register register,  Address offset: 0x104 */
	__IO uint32_t SPIC_WRITE_ENABLE ;                      /*!<  Write Enable Command Register register,  Address offset: 0x108 */
	__IO uint32_t SPIC_READ_STATUS ;                       /*!<  Read Status Command Register register,  Address offset: 0x10C */
	__IO uint32_t SPIC_CTRLR2 ;                            /*!<  SPIC Control Register 2 register,  Address offset: 0x110 */
	__IO uint32_t SPIC_FBAUDR ;                            /*!<  Fast Read Baud Rate Select Register register,  Address offset: 0x114 */
	__IO uint32_t SPIC_ADDR_LENGTH ;                       /*!<  Address Byte Length Register register,  Address offset: 0x118 */
	__IO uint32_t SPIC_AUTO_LENGTH ;                       /*!<  Auto Mode Address Byte Length Register register,  Address offset: 0x11C */
	__IO uint32_t SPIC_VALID_CMD ;                         /*!<  Valid Command Register register,  Address offset: 0x120 */
	__IO uint32_t SPIC_FLASH_SIZE ;                        /*!<  Write Enable Command Register register,  Address offset: 0x124 */
	__O  uint32_t SPIC_FLUSH_FIFO ;                        /*!<  Read Status Command Register register,          Address offset: 0x128 */
} SPIC_TypeDef;
/** @} */

#endif
